wouyanglv/ble-archives/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/Implantable MA - iis3dwb/main.c
#ifndef SEND_BLE
        // Send and display received samples

            // send sample over BLE
            err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, last_sample_timestamp, 
                                    num_samples, ecgSamples, dev_type);

            while (err_code == NRF_ERROR_RESOURCES) 
            {
                nrf_delay_ms(100);
                retry_ble_send = true;
                SEGGER_RTT_printf(0, "SEND STATUS TRYING\r\n");
                err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, last_sample_timestamp, 
                                    num_samples, ecgSamples, dev_type);
            }
            if ((err_code != NRF_SUCCESS) &&
                (err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != NRF_ERROR_RESOURCES) &&
                (err_code != NRF_ERROR_BUSY) &&
                (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
               )
            {
                APP_ERROR_HANDLER(err_code);
            }

            //display timestamp + sample
            //float floatNumber = (float)sample_timestamp/1000000.0f;
           // uint32_t intPart = (uint32_t)floatNumber;
           // uint32_t decimalPart = (floatNumber - intPart) * 1000000;
            //if (m_sample_num[dev_type] % 1000 == 0 || retry_ble_send)
               // SEGGER_RTT_printf(0, "%d :: %d.%d :: %d\r\n", (uint32_t)m_sample_num[dev_type], intPart, decimalPart, ecgSamples[i]);
#endif
    }
    else if ((status & EOVF_STATUS) == EOVF_STATUS)
    {
        max30003_reset_fifo(dev); // Reset FIFO
        SEGGER_RTT_printf(0, "Pre-read FIFO overflow!\r\n");
    }

    // Check if FIFO overflowed while we were sending BLE data, if so reset the FIFO
    ret = max30003_get_status(dev, &status);      // Read the STATUS register
    if ((status & EOVF_STATUS) == EOVF_STATUS)
    {
        max30003_reset_fifo(dev); // Reset FIFO
        SEGGER_RTT_printf(0, "Reset FIFO\r\n");
    }
}
*/

static void read_sensor_data(stmdev_ctx_t *ctx) {

  uint8_t wtm_status;
  uint8_t fifo_ovr;
  uint16_t unread_num;
  uint64_t last_timestamp;
  uint16_t length;
  ret_code_t ret;
  ret_code_t err_code;
  bool retry_ble_send = false;

  iis3dwb_fifo_wtm_flag_get(ctx, &wtm_status);

  if (wtm_status) {
    length = 0;
    last_timestamp = rtc_timestamp_get();

    for (int i = 0; i < WATERMARK_THRESHOLD; i++) {
      iis3dwb_fifo_out_raw_get(ctx, data_raw_acceleration.u8bit);
      memcpy(&(xl_raw[length]), data_raw_acceleration.u8bit, 6 * sizeof(uint8_t));
      length += 6;
    }
    
    err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, WATERMARK_THRESHOLD, last_timestamp, xl_raw);

    while (err_code == NRF_ERROR_RESOURCES) {
      nrf_delay_ms(100);
      retry_ble_send = true;
      SEGGER_RTT_printf(0, "SEND STATUS TRYING\r\n");
      err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, WATERMARK_THRESHOLD, last_timestamp, xl_raw);
    }
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)) {
      APP_ERROR_HANDLER(err_code);
    }

    iis3dwb_fifo_ovr_flag_get(ctx, &fifo_ovr);

    if (fifo_ovr == 1) {
      SEGGER_RTT_printf(0, "fifo overrun!\n");
      iis3dwb_fifo_mode_set(ctx, IIS3DWB_BYPASS_MODE); // Bypass mode is used to reset the FIFO
      iis3dwb_fifo_mode_set(ctx, IIS3DWB_STREAM_MODE);
    }
  }
}

static ret_code_t platform_write(uint8_t reg, uint8_t *bufp,
    uint16_t len) {

  ret_code_t ret;

  uint8_t tx_buf[len + 1];
  tx_buf[0] = reg;
  for (int i = 0; i < len; i++) {
    tx_buf[i + 1] = bufp[i];
  }

  ret = spi_transfer(SPI_INSTANCE_0, tx_buf, len + 1, NULL, 0, false);

  return ret;
}

static ret_code_t platform_read(uint8_t reg, uint8_t *bufp,
    uint16_t len) {
  ret_code_t ret;

  reg |= 0x80;
  uint8_t tx_buf[len + 1];
  uint8_t rx_buf[len + 1];
  tx_buf[0] = reg;
  for (int i = 0; i < len; i++) {
    tx_buf[i + 1] = 0xAAU;
  }

  ret = spi_transfer(SPI_INSTANCE_0, tx_buf, len + 1, rx_buf, len + 1, false);
  for (int i = 0; i < len; i++) {
    bufp[i] = rx_buf[i + 1];
  }

  return ret;
}

int main(void) {

  bool erase_bonds;

  // Initialize timers
  log_init();
  timers_init();

  // Delay startup to allow power harvesting to ramp up
  lfclk_request(); //turn on here because we need it before softdevice is started
  m_startup_delay = true;
  ret_code_t err_code = app_timer_start(m_startup_delay_timer_id, STARTUP_DELAY, NULL);
  APP_ERROR_CHECK(err_code);

  SEGGER_RTT_printf(0, "Waiting for startup delay...\r\n");

  while (m_startup_delay) {
    idle_state_handle();
  }

  // Remainder of initialization
  rtc_config();
  buttons_leds_init(&erase_bonds);
  power_management_init();
  ble_stack_init();
  gap_params_init();
  gatt_init();
  advertising_init();
  services_init();
  conn_params_init();
  peer_manager_init();

  // Start execution.
  NRF_LOG_INFO("EEG/EMG monitoring started.");
  application_timers_start();
  advertising_start(erase_bonds);

  // wait for RTC to finish initializing
  while (!m_rtc_init) {
    idle_state_handle();
  }

  spi_init();

  stmdev_ctx_t dev_ctx;
  dev_ctx.write_reg = platform_write;
  dev_ctx.read_reg = platform_read;

  while (whoamI != IIS3DWB_ID) {
    iis3dwb_device_id_get(&dev_ctx, &whoamI);
  }

  //  Restore default configuration
  iis3dwb_reset_set(&dev_ctx, PROPERTY_ENABLE);
  do {
    iis3dwb_reset_get(&dev_ctx, &rst);
  } while (rst);

  /*
   *  Enable Block Data Update
   */
  iis3dwb_block_data_update_set(&dev_ctx, PROPERTY_ENABLE);

  /*
   * Set Output Data Rate
   */

  iis3dwb_xl_data_rate_set(&dev_ctx, IIS3DWB_XL_ODR_26k7Hz);

  /*
   * Set full scale
   */
  iis3dwb_xl_full_scale_set(&dev_ctx, IIS3DWB_2g);

  /*
   * Configure filtering chain(No aux interface)
   *
   * Accelerometer - LPF1 + LPF2 path
   */
  iis3dwb_xl_hp_path_on_out_set(&dev_ctx, IIS3DWB_LP_ODR_DIV_20);
  iis3dwb_xl_filter_lp2_set(&dev_ctx, PROPERTY_ENABLE);

  /*
   * Configure FIFO
   */
  iis3dwb_fifo_mode_set(&dev_ctx, IIS3DWB_BYPASS_MODE); // Bypass mode is used to reset the FIFO
  iis3dwb_fifo_mode_set(&dev_ctx, IIS3DWB_STREAM_MODE);
  iis3dwb_fifo_watermark_set(&dev_ctx, WATERMARK_THRESHOLD);
  iis3dwb_fifo_xl_batch_set(&dev_ctx, IIS3DWB_XL_BATCHED_AT_26k7Hz);


  while (1) {
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {

      read_sensor_data(&dev_ctx);
    }

#ifdef NRF52_DK
    bsp_board_led_invert(BSP_BOARD_LED_3);
#endif

    //        idle_state_handle();
  }
}